<?php
/*
今有鸡翁一，值钱五；鸡母一，值钱三；鸡雏一，值钱一；
百钱买鸡百只，问鸡翁，母，雏各几何。
*/
for($g=1; $g<=100; $g++){
	for($m=1; $m<=100; $m++){
		for($x=1; $x<=100; $x++){
			if(($g + $m + $x == 100) && ($g * 5 + $m * 3 + $x * 1/3 ==100)){
				echo '翁，母，雏各', $g, '&nbsp;', $m, '&nbsp;', $x, '<br />';
			}
		}
	}
}

for($g=1; $g<=20; $g++){
	for($m=1; $m<=33; $m++){
		$x = 100 - $g - $m;
		if(($g + $m + $x == 100) && ($g * 5 + $m * 3 + $x * 1/3 ==100)){
				echo '翁，母，雏各', $g, '&nbsp;', $m, '&nbsp;', $x, '<br />';
		}
	}
}



















 ?>